In [1]:
import pandas as pd

In [2]:
exam_scores = pd.read_csv("exam_scores.csv")

In [3]:
exam_scores.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66
2,male,group C,some college,free/reduced,none,66,65,65
3,female,group D,bachelor's degree,free/reduced,none,74,75,73
4,male,group D,some college,standard,none,78,77,71

In [4]:
exam_scores.gender

0        male
1      female
2        male
3      female
4        male
        ...
995    female
996    female
997    female
998    female
999      male
Name: gender, Length: 1000, dtype: object

In [5]:
exam_scores['gender']

0        male
1      female
2        male
3      female
4        male
        ...
995    female
996    female
997    female
998    female
999      male
Name: gender, Length: 1000, dtype: object

In [6]:
# Selecting multiple columns

exam_scores[['gender', 'lunch']]

     gender         lunch
0      male      standard
1    female      standard
2      male  free/reduced
3    female  free/reduced
4      male      standard
..      ...           ...
995  female      standard
996  female      standard
997  female  free/reduced
998  female      standard
999    male  free/reduced

[1000 rows x 2 columns]

In [10]:
exam_scores.lunch = "male"

In [11]:
exam_scores.lunch

0      male
1      male
2      male
3      male
4      male
       ...
995    male
996    male
997    male
998    male
999    male
Name: lunch, Length: 1000, dtype: object